package plate

// 车牌颜色码表
var PlateColorMap = map[int]string{
	0: "未知",
	1: "蓝色",
	2: "黄色",
	3: "白色",
	4: "黑色",
	5: "绿色",
	6: "黄绿色",
}

// 车牌类型码表
var PlateTypeMap = map[int]string{
	0:  "未知车牌",
	1:  "蓝牌小汽车",
	2:  "黑牌小汽车",
	3:  "单排黄牌",
	4:  "双排黄牌",
	5:  "警车车牌",
	6:  "武警车牌",
	7:  "个性化车牌",
	8:  "单排军车牌",
	9:  "双排军车牌",
	10: "使馆车牌",
	11: "香港进出中国大陆车牌",
	12: "农用车牌",
	13: "教练车牌",
	14: "澳门进出中国大陆车牌",
	15: "双层武警车牌",
	16: "武警总队车牌",
	17: "双层武警总队车牌",
	18: "民航车牌",
	19: "新能源车牌",
	20: "大型新能源",
	21: "应急车",
	22: "领事馆",
	23: "新标准燃油车",
	24: "新标准新能源",
	25: "机场车牌",
	26: "海外车牌",
	29: "假车牌",
	30: "车标",
	31: "无牌车",
}

// 车身颜色码表
var CarBodyColorMap = map[int]string{
	0:   "白",
	1:   "银（灰）",
	2:   "黄",
	3:   "粉",
	4:   "红",
	5:   "绿",
	6:   "蓝",
	7:   "棕",
	8:   "黑",
	255: "未知",
}

// 运动方向码表
var DirectionMap = map[int]string{
	0: "未知",
	1: "左",
	2: "右",
	3: "上",
	4: "下",
}

// 车辆类型码表
var VehicleTypeMap = map[int]string{
	0x00: "未知",
	0x01: "轿车",
	0x02: "SUV",
	0x03: "MPV",
	0x04: "小型客车",
	0x05: "大型客车",
	0x06: "小型货车",
	0x07: "大型货车",
}

// 开闸类型码表
var OpenGateTypeMap = map[int]string{
	0: "无开闸",
	1: "服务器触发开闸",
	2: "脱机状态白名单开闸",
}
